src/Catalogs/ТаблицыМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТаблицыМетаданных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИБ_1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗД_ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТаблицыХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метаданные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>update</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ТаблицыМетаданных/Ext/ManagerModule.bsl
Функция ПолучитьЗапись(ИмяБД,ИмяТаблицыХранения,ИмяТаблицы,Метаданные) Экспорт
	
	мСсылкаНаЗапись = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицыМетаданных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТаблицыМетаданных КАК ТаблицыМетаданных
		|ГДЕ
		|	ТаблицыМетаданных.ИБ_1С = &ИБ_1С
		|	И ТаблицыМетаданных.ИмяТаблицыХранения = &ИмяТаблицыХранения
		|	И ТаблицыМетаданных.ИмяТаблицы = &ИмяТаблицы
		|	И ТаблицыМетаданных.Метаданные = &Метаданные
		|	И НЕ ТаблицыМетаданных.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИБ_1С", ИмяБД);
	Запрос.УстановитьПараметр("ИмяТаблицы", ИмяТаблицы);
	Запрос.УстановитьПараметр("ИмяТаблицыХранения", ИмяТаблицыХранения);
	Запрос.УстановитьПараметр("Метаданные", Метаданные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		мСсылкаНаЗапись = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат мСсылкаНаЗапись;
	
	
КонецФункции   

Функция ОбновитьЗапись(ИмяБД,СтруктураПолей) Экспорт

	СсылкаНаЗапись = ПолучитьЗапись(ИмяБД,СтруктураПолей.ИмяТаблицыХранения,СтруктураПолей.ИмяТаблицы,СтруктураПолей.Метаданные);
	
	Если СсылкаНаЗапись = Неопределено Тогда
		СО = Справочники.ТаблицыМетаданных.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(СО,СтруктураПолей);	
		СО.ИБ_1С = ИмяБД;
		СО.Наименование = ?(ПустаяСтрока(СО.ИмяТаблицы),СО.ИмяТаблицыХранения,СО.ИмяТаблицы);
		СО.update = ТекущаяДата();
		СО.Записать();		
	КонецЕсли;
	
	
	
КонецФункции
